Tekla Open API Reference for Tekla Structures 2025
PickerInputNPoints.PickedPoints Property
 Gets or sets the list of picked points in the view coordinates.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PointList PickedPoints { get; set; }
Public Property PickedPoints As PointList
	Get
	Set
Property Value
Type: PointList
See Also
Reference
PickerInputNPoints Class
Tekla.Structures.Drawing Namespace